In [2]:
import numpy as np
import pandas as pd

In [35]:
data = np.array([np.arange(4)]*3)
data

array([[0, 1, 2, 3],
       [0, 1, 2, 3],
       [0, 1, 2, 3]])

In [36]:
cols = ['A','B', 'C','D']

In [37]:
df = pd.DataFrame(data, columns = cols)

In [38]:
df['Something'] = ['Alpa', 'Bravo', 'Charlie']

In [50]:
df

   A  B  C  D Something
0  0  1  2  3      Alpa
1  0  1  2  3     Bravo
2  0  1  2  3   Charlie

In [41]:
melted = pd.melt(df, id_vars='Something', value_vars=['A','B','C','D'])

In [42]:
melted

   Something variable  value
0       Alpa        A      0
1      Bravo        A      0
2    Charlie        A      0
3       Alpa        B      1
4      Bravo        B      1
5    Charlie        B      1
6       Alpa        C      2
7      Bravo        C      2
8    Charlie        C      2
9       Alpa        D      3
10     Bravo        D      3
11   Charlie        D      3

In [59]:
un_melted = melted.pivot(index='Something', columns='variable', values='value').reset_index('Something')

In [60]:
un_melted

variable Something  A  B  C  D
0             Alpa  0  1  2  3
1            Bravo  0  1  2  3
2          Charlie  0  1  2  3

In [65]:
un_melted.columns.name = None

In [66]:
un_melted

  Something  A  B  C  D
0      Alpa  0  1  2  3
1     Bravo  0  1  2  3
2   Charlie  0  1  2  3